#!/usr/bin/env python
# -*- coding:utf-8 -*-
# mr wang


""" 不可变类型(元组,数字,字符串)的拷贝
  1> 如果在多层嵌套中都是不可变类型
     浅拷贝与深拷贝都是相同的 ，都不会单独开辟内存空间，而是引用原来的内存空间
  2> 如果顶层是不可变类型，但内部元素有嵌入可变类型
     浅拷贝还是不会开辟新的内存空间，而是引用原来的内存空间
     深拷贝 会拷贝对象的所有层数据


"""
import copy
a = [11, 22]
b = (33, 44)
c = (a, b) # c = ([11,22],(33, 44))
print("------------浅拷贝----------------")
d = copy.copy(c)
print("a----->%d    c[0]------>%d" % (id(a), id(c[0])))
print("c----->%d    d------>%d" % (id(c), id(d)))
print("a----->%d    d[0]------>%d" % (id(a), id(d[0])))




print("--------------深拷贝----------------------")
d = copy.deepcopy(c)
print("a----->%d    c[0]------>%d" % (id(a), id(c[0])))
print("c----->%d    d------>%d" % (id(c), id(d)))
print("a----->%d    d[0]------>%d" % (id(a), id(d[0])))








